flapping_wing_3d_overset/backGround/0_org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    oversetPatch
    {
        patchType       overset;
        type            zeroGradient;

        //type            overset;
	//value		$internalField;
    }

    wing
    {
        //type            fixedValue;
        //value		uniform (0 0 0);

	type            zeroGradient;
    }

    "(left|Right|top|Bottom|frontAndBack)"
    {
        //type            uniformFixedValue;	//old
        //uniformValue    (0 0 0);		//old

        type            fixedValue;
        value		uniform (0 0 0);
    }

}

// ************************************************************************* //
